#### Creating of series and exploring its methods and attributes

In [ ]:
import pandas as pd
import numpy as np
pd.__version__

In [4]:
pd?

In [5]:
data  = pd.Series([5,3,0,-2])
data

0    5
1    3
2    0
3   -2
dtype: int64

In [10]:
data[0]

5

In [14]:
type(data)

pandas.core.series.Series

In [22]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
population_dict = {'California': 1234456,
                  'Texas': 1234321234,
                  'New York': 6754356,
                  'Florida': 989089,
                  'Illinois': 12882135}
population = pd.Series(population_dict)
population

California       1234456
Texas         1234321234
New York         6754356
Florida           989089
Illinois        12882135
dtype: int64

In [16]:
population['California']

1234456

In [17]:
population['California':'New York']

California       1234456
Texas         1234321234
New York         6754356
dtype: int64

In [18]:
data.values

array([ 5,  3,  0, -2], dtype=int64)

In [20]:
data.isnull()

0    False
1    False
2    False
3    False
dtype: bool

Create a single column of data having year and rainfall from 1995 to 2023.

In [29]:
data = {
    '1995': 3.8,
    '1996': 3.9,
    '1997': 4.0,
    '1998': 4.1,
    '1999': 4.2,
    '2000': 4.1,
    '2001': 4.0,
    '2002': 3.9,
    '2003': 3.8,
    '2004': 3.7,
    '2005': 3.6,
    '2006': 3.5,
    '2007': 4.9,
    '2008': 5.9,
    '2009': 2.9,
    '2010': 5.4,
    '2011': 5.3,
    '2012': 4.4,
    '2013': 1.4,
    '2014': 3.4,
    '2015': 5.8,
    '2016': 5.5,
    '2017': 7.3,
    '2018': 8.0,
    '2019': 5.4,
    '2020': 8.4,
    '2021': 3.4,
    '2022': 6.4,
    '2023': 3.4,
}
data1 = pd.Series(data)

Avg rainfall

In [27]:
data1.mean()

4.613793103448277

Maximum rainfall

In [28]:
data1.max()

8.4

Minimum rainfall

In [30]:
data1.min()

1.4

In [36]:
data1.median()

4.1

In [37]:
data1.cummax()

1995    3.8
1996    3.9
1997    4.0
1998    4.1
1999    4.2
2000    4.2
2001    4.2
2002    4.2
2003    4.2
2004    4.2
2005    4.2
2006    4.2
2007    4.9
2008    5.9
2009    5.9
2010    5.9
2011    5.9
2012    5.9
2013    5.9
2014    5.9
2015    5.9
2016    5.9
2017    7.3
2018    8.0
2019    8.0
2020    8.4
2021    8.4
2022    8.4
2023    8.4
dtype: float64

In [38]:
data1.describe()

count    29.000000
mean      4.613793
std       1.540808
min       1.400000
25%       3.700000
50%       4.100000
75%       5.400000
max       8.400000
dtype: float64

In [40]:
data1.quantile()

4.1

In [41]:
data1.shape

(29,)

In [42]:
data1.ndim

1

 Pandas Data Frames

In [10]:
d = {
    'state': ['NY','NY','NY','NY','NY'],
    'year': [2008,2010,2011,2008,2010],
    'pop': [20.1,19.4,18.7,10,np.nan]
}
frame = pd.DataFrame(d)
frame

  state  year   pop
0    NY  2008  20.1
1    NY  2010  19.4
2    NY  2011  18.7
3    NY  2008  10.0
4    NY  2010   NaN

In [11]:
#We may change column order as
frame = pd.DataFrame(d, columns = ['year', 'pop', 'state'])
frame

   year   pop state
0  2008  20.1    NY
1  2010  19.4    NY
2  2011  18.7    NY
3  2008  10.0    NY
4  2010   NaN    NY

In [18]:
frame.shape[1]

3

In [20]:
frame.columns

Index(['year', 'pop', 'state'], dtype='object')

In [21]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    5 non-null      int64
 1   pop     4 non-null      float64
 2   state   5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [22]:
frame.describe()

              year        pop
count     5.000000   4.000000
mean   2009.400000  17.050000
std       1.341641   4.734624
min    2008.000000  10.000000
25%    2008.000000  16.525000
50%    2010.000000  19.050000
75%    2010.000000  19.575000
max    2011.000000  20.100000

In [24]:
frame.describe(include=object)

       state
count      5
unique     1
top       NY
freq       5

In [25]:
frame.describe(include='all')

               year        pop state
count      5.000000   4.000000     5
unique          NaN        NaN     1
top             NaN        NaN    NY
freq            NaN        NaN     5
mean    2009.400000  17.050000   NaN
std        1.341641   4.734624   NaN
min     2008.000000  10.000000   NaN
25%     2008.000000  16.525000   NaN
50%     2010.000000  19.050000   NaN
75%     2010.000000  19.575000   NaN
max     2011.000000  20.100000   NaN

In [30]:
frame['year*pop'] = frame['year']*frame['pop']
frame

   year   pop state  year*pop  year+pop
0  2008  20.1    NY   40360.8    2028.1
1  2010  19.4    NY   38994.0    2029.4
2  2011  18.7    NY   37605.7    2029.7
3  2008  10.0    NY   20080.0    2018.0
4  2010   NaN    NY       NaN       NaN